// mockReviews.ts

export interface Review {
    id: string;
    name: string;
    rating: number;
    comment: string;
  }
  
  export const mockReviews: Review[] = [
    {
      id: "1",
      name: "Bank",
      rating: 4,
      comment: "ให้แค่นี้ก่อน เดี๋ยวไปแล้วค่อยเพิ่มดาวให้",
    },
    {
      id: "2",
      name: "Mook",
      rating: 4,
      comment: "ชอบความสะอาดของสถานที่ และเจ้าหน้าที่บริการดีมาก",
    },
    {
        id: "4",
        name: "Nam",
        rating: 4.5,
        comment: `
      ประทับใจตั้งแต่ก้าวแรกที่มาถึงแคมป์เลยค่ะ บรรยากาศที่นี่เงียบสงบ เหมาะกับการมาพักผ่อนจริงๆ ตัวแคมป์ตั้งอยู่ใกล้ลำธาร มีเสียงน้ำไหลเบาๆ ตลอดทั้งวัน ซึ่งช่วยให้รู้สึกผ่อนคลายมากๆ เรามาพักกันเป็นกลุ่มเพื่อน 4 คน เลือกเต็นท์ใหญ่ที่สามารถนอนได้สบายๆ มีพื้นที่ให้นั่งเล่นหน้าลานและทำอาหารเย็นกันเองได้ด้วย
      
      สิ่งที่อยากชมเป็นพิเศษคือพนักงานดูแลดีมาก สุภาพ ให้ข้อมูลละเอียด พาเดินสำรวจรอบๆ ก่อนเข้าแคมป์ และยังแนะนำเส้นทางเดินป่าระยะสั้นที่อยู่ใกล้ๆ ด้วย ห้องน้ำรวมแม้จะอยู่ไกลจากบางจุดไปนิดหน่อย แต่สะอาดมาก มีน้ำอุ่นและมีไฟสว่างเพียงพอตลอดทั้งคืน
      
      ข้อเสนอแนะเดียวคือเรื่องที่จอดรถควรมีการจัดการให้เป็นระเบียบกว่านี้ เพราะบางคันจอดล้ำเข้ามาใกล้ลานแคมป์ไปนิด แต่โดยรวมคือดีมาก ประสบการณ์ดีๆ แบบนี้อยากให้เพื่อนๆ มาลองกันค่ะ จะกลับมาอีกแน่นอนถ้ามีโอกาส!
        `,
      },
      
    {
      id: "4",
      name: "Fah",
      rating: 1,
      comment: "ไม่ชอบเลยค่ะ น่าเบื่อสุดๆ",
    },
    {
      id: "5",
      name: "Joe",
      rating: 2,
      comment: "วันที่ไปเจอฝนตกหนัก น้ำท่วมเล็กน้อย อยากให้เตรียมรับมือดีกว่านี้",
    },
  ];
  